[
  {
    "id": 0,
    "img": "IQP",
    "name": "Isolated Queens Pawn (IQP)",
    "description": "This structure is defined by a pawn on the d file that has no neighboring pawns to protect it.",
    "whitePlans": [
      "Create a kingside attack. Most standard plans will include the moves Ne5,Bg5 and the battery Qd3-Bc2. In some cases a piece sacrifice on the kingside is needed to break through. Rooks are typically placed on e1 and d1 (or c1), and a rook transfer via the third rank is possible",

      "Break in the center with d4-d5, trading pawns and opening lines with an initiative (sometimes this break can be achieved with a pawn sacrifice with the same purpose)"
    ],
    "blackPlans": [
      "Trade pieces to win an endgame. In particular, exchange white's good bishop (the light squared bishop)",
      "Place a knight on d5. This blockading square prevents the central break d4-d5, and controls key squares. In an endgame, a rook, bishop or king would be strong on this square"
    ]
  },

  {
    "id": 1,
    "img": "HP",
    "name": "Hanging Pawns",
    "description": "This structure is defined by connected c and d pawns that cannot be reinforced by pawns. This structure is closely related to the IQP. White has better middlegame prospects due to his spatial edge while black should aim for an endgame, where the hanging pawns will be weak",
    "whitePlans": [
      "Create a kingside attack. Most standard plans will include the moves Ne5, Bc2, Qd3 and a rook transfer through the third rank, via Re1-Re3-Rh3",

      "Break in the center with d4-d5 to open lines or to create a strong passed pawn on the d file"
    ],
    "blackPlans": [
      "Trade pieces to win an endgame. The hanging pawns tend to be a serious liability in the endgame",
      "Apply pressure to the central pawns. Blockade them if possible",
      "Break the handing pawns, either with the b5 or e5 pawn thrust. These breaks are difficult to achieve, especially because an experienced player will prevent them. Successfully achieving this plan transforms the game into an IQP position"
    ]
  },

  {
    "id": 2,
    "img": "Carlsbad",
    "name": "Carlsbad",
    "description": "This pawn structure is prevalent in many lines of the Exchange Queens Gambit. This structure can be reached in the exchange Caro-Kann as well, but with reversed colors",
    "whitePlans": [
      "Aim for a minority attack with b2-b4-b5 to create queenside weaknesses.",
      "Try to break in the center with f2-f3 and e3-e4 (sometimes e3-e4 directly) gaining space and increasing the tension"
    ],
    "blackPlans": [
      "Place a knight on e4, which from there controls key squares and supplements a kingside attack. This plan is not always possible because white has the option of playing f2-f3",
      "Try to play ...b6 followed by ...c5 to chip at the strong d4 pawn. This will result in a transformation to the hanging pawns structure. Sometimes ...c5 can be played without ...b6, which likely transposes to an IQP",
      "Play b7-b5 one white has b2-b4 to create a firm outpost on the c4 square and to slow down the minority. This plan is less common because it creates a weakness on c6."
    ]
  },

  {
    "id": 3,
    "img": "Slav",
    "name": "Slav Formation",
    "description": "This structure is often reached from the Semi Slav as well as the Queen's Gambit Accepted. White typically has the advantage due to the space his d4 pawn gives them",
    "whitePlans": [
      "Create a kingside attack, with h2-h4-h5-h6(or hxg6) and possible e4-e4-e5",

      "Place knights on the e5 and c5 squares, which control the center",
      "Play e4-e5 to fix the center and control the d6 square",
      "Create a minority attack with a2-a4 and b2-b4-b5, in order to create queenside weaknesses",
      "Preventing the c5 break with b2-b4. This pawn advance also gains queenside space which can squeeze black"
    ],
    "blackPlans": [
      "Achieve the c5 break, which gives the pieces more scope. The pawn structure can transform into a symmetrical one after dxc5, or an IQP ...cxd4",
      "Achieve the e5 break, undermining the d4 pawn and gaining scope for the pieces",
      "Exert pressure on the d4 pawn once e3-e4 has been played",
      "Disrupting white's center and gaining some influence on the center with f7-f5"
    ]
  },

  {
    "id": 4,
    "img": "Stonewall",
    "name": "Stonewall",
    "description": "This structure is often reached from the Dutch Defense, the Slav or the Catalan. It has the characteristic pawns on d5,e6 and f5.",
    "whitePlans": [
      "Obtain control of the e5 square, as it is an outpost. It would be ideal to place a knight on this square",
      "Trade dark squared bishops, exacerbating black's weak dark squares",
      "Expand on the queenside or open the c file to perform active operations on the open file"
    ],
    "blackPlans": [
      "Create an attack on the kingside, but without completely losing control of the central squares as white can gain counterplay there (especially on the e5 square)",
      "Improve the bad light squared by bishop via ...Bd7-Be8-Bh5 or via ...b6 followed by Ba6",
      "Create central pressure with ...b6 followed by ...c5"
    ]
  },

  {
    "id": 5,
    "img": "Sicilian",
    "name": "Sicilian",
    "description": "This structure is seen is some variations of the sicilian, such as the Najdorf, Kalashnikov and Sveshnikov. It is a very rich structure, both tactically and strategically., The d5 square and semi-open c file are prevalent features of the structure",
    "whitePlans": [
      "Place a knight on d5, and have enough pieces to always be able to recapture with a piece rather than the pawn to always have an avenue to black's backwards d6 pawn",

      "Advance the g pawn to g4-g5 to create a kingside pawn storm but also to remove the knight from f6, a defender of the d5 square and the king",
      "Play e4-e5 to fix the center and control the d6 square",
      "Trade the dark squared bishop for the knight on f6, to eliminate the defender of the d5 square as well as the pressure the knight exerts on e4",
      "Advance the f pawn to f4-f5, preventing black from place his light squared bishop on e6, where it would control the d5 square"
    ],
    "blackPlans": [
      "Break in the center ...d5, which would remove the backwards pawn, give the pieces more scope and create an initiative on the center",
      "Exert pressure on the c file, so that white cannot play Nc3-d5 because of the vulnurable pawn on c2",
      "Play ...b5-b4 to create an attack on the queenside as well as expel white's knight from c3, so that black can achieve the d5 break"
    ]
  },

  {
    "id": 6,
    "img": "SicilianD5",
    "name": "Sicilian with d5 pawn",
    "description": "This structure typically arises from a normal open sicilian where white recaptures on d5 with a pawn. This recapture dramatically changes the position and the plans of both sides",
    "whitePlans": [
      "White now has a pawn majority on the queenside, so advancing the queenside majority with b4 and c4-c5 is strong",
      "On occasions after black has played ...f5, white can place his bishop on b1-h7 diagonal and play g4, breaking up black's pawn structure"
    ],
    "blackPlans": [
      "Expand on the kingside with ...f5 and develop a kingside attack",
      "Restrict or undermine white's queenside expansion with the b5 pawn thrust"
    ]
  },

  {
    "id": 7,
    "img": "Maroczy",
    "name": "Maroczy Bind",
    "description": "This structure has pawns on c4 and e4 for white, with a missing d pawn",
    "whitePlans": [
      "Gain space with a queenside expansion, place a knight on d5, and/or expand on the kingside with the the f4 pawn thrust",
      "After f4 has been played, place rooks on the central files and break with either e5 or f5",
      "Place a knight on d5 and wait for black to capture on d5. White can then transform to a favorable structure with exd5 or cxd5. With cxd5, white will be using the c file and trying to squeeze black. With exd5, white is aiming for a tactial and double-edged game where white will go for a mating attack"
    ],
    "blackPlans": [
      "Trade pieces to decrease the space problem",
      "Break on the queenside and contest white's strong bind with ...b5, and after the cxb5 ...axb5, apply pressure along the a file",
      "Break on the kingside with ...f5 and later create an attack against the white king",
      "Pressure the queenside pawns with ...Qb6-Qb4",
      "On rare occasions play ...e6 followed by ...d5"
    ]
  },

  {
    "id": 8,
    "img": "Benoni",
    "name": "Benoni",
    "description": "This is a very tactical pawn structure, that appears in the Benoni and some variations of the Ruy Lopez.",
    "whitePlans": [
      "Break in the center with e5, either to create an attack or to create a central passed pawn",
      "Break with e5 followed by f5 to obtain a kingside attack",
      "Break with f5 followed by a kingside attack down the f file"
    ],
    "blackPlans": [
      "Advance the queenside majority with ...b5,...c4,...b4 etc. Create a passed pawn if possible",
      "apply pressure down the e file, preventing white from advancing his central majority and forcing them to babysit the e4 pawn",
      "Create kingside play with ...h5-...h4 when white has a knight on g3",
      "Break white's center with ...f5. This plan is stronger when white has already played f4, since the f5 pawn thrust will weaken the d5 pawn",
      "Trade off black's light squared bishop, since it is black's worst piece because it does not contribute to the advance of the queenside pawns. Endgames in general tend to favor black because of their ability to create a passed pawn on the queenside"
    ]
  },

  {
    "id": 9,
    "img": "Kid",
    "name": "King's Indian",
    "description": "This pawn structure is seen mostly in the main lines of the King's Indian Defense, but can also arise from the Bogo-Indian and the open games. This structure yields play on opposite flanks",
    "whitePlans": [
      "Break on the queenside with c4-c5-cxd6 and invade via the c file",
      "Expand on the queenside with c4-c5-c6, and if black responds with ...b6, invade down the a file after a4-a5-axb6",
      "Implement restrictive measures with g4, slowling down or neutralizing black's kingside play, and only then proceed with the above queenside plans. These plans are commonly seen in the Petrosian and Makagonov variation of the King's Indian Defense",
      "If black allows it, respond to ...f5 with Ng5-Ne6",
      "Trade light squared bishops to reduce black's attacking potential. Black's light squared bishop is a key piece for black as it often takes part in sacrifices on the kingside to break the white king's defenses"
    ],
    "blackPlans": [
      "Create a kingside attack with ...f5-f4 and later ...g5-g4-g3, or ...gxf3 attacking the f3 pawn, which becomes the base of the pawn chain",
      "Open the f file via ...f5-fxe4 and create an attack via this file, or pressure e4 pawn",
      "Play ...h5-h4 and ...Bh6, which activates the rather useless bishop on g7",
      "Play ...c6 to contest the center and challenge white's grasp of it",
      "Play ...c5 to slow down white's queenside play"
    ]
  },

  {
    "id": 10,
    "img": "French",
    "name": "Advanced French",
    "description": "This structure typically arises from the French or Caro-Kann, when gains space with the pawn advance to e5, but it can be obtained from other openings, one being the Catalan. White tends to play for an attack on the kingside due to his e5 pawn, while black plays on the queenside",
    "whitePlans": [
      "Attack the base of black's pawn chain with f4-f5-fxe6",
      "Create a kingside attack with f4-f5-f6, followed by mate threats on the g7 square",
      "Attack black's kingside with rooks along the third rank, a bishop on the b1-h7 diagonal and a queen on h5. A piece sacrifice on the kingside is often required to break through. Greek gift sacrifices are very common in this structure"
    ],
    "blackPlans": [
      "Attack the base of white's pawn chain, which is white's d4 pawn, with ...c5, ...Nc6 and ...Qb6. In some cases use major pieces to invade down the c file",
      "Advance ...c5-c4, and then attack the new base of the chain (the c3 pawn) with ...b5-b4. Beware that this plan can be too slow if white has an initiative on the kingside",
      "Trade light squared bishops, since this is black's worst piece, but also because in many instances, white's light squared bishop plays a crucial role in the kingside attack",
      "Slow down white's kingside attack with ...f5, or challenge white's center with ...f6"
    ]
  },

  {
    "id": 11,
    "img": "CRL",
    "name": "Closed Ruy Lopez",
    "description": "This structure arises almost exclusively from the Closed Ruy Lopez defenses. Due to black's extra space on the queenside (c4 pawn), black has the option to seek play on the queenside",
    "whitePlans": [
      "Create a kingside attack with g4, Nbd2-Nf1-Ng3-Nf5, sacrifice a piece on f5 if needed",
      "Create a kingside attack with f4",
      "Play on the queenside with b4, a4 and then invade on the a file or attack one of black's queenside pawns"
    ],
    "blackPlans": [
      "Create queenside play with ...a5,...b5-b4",
      "Expand on the kingside with ...f5-f4, in King's Indian fashion. In many cases this plan will not be available to black because white will likely have a large concentration of pieces on the kingside, therefore they will be stronger on that side of the board"
    ]
  }
]
